# Программа для определения принадлежности точки фигуре "бабочки"
# Степнов Сергей
# Группа ИУ7-16Б

# Импорт модулей
from math import sqrt

# Ввод координат точки
x, y = map(float, input("Введите координаты точки в формате 'x y': ").split())

# Основной блок программы

# Левая верхняя часть крыльев
if -1 / 8 * (x + 9) ** 2 + 8 >= y >= 1 / 49 * (x + 1) ** 2 and -8 <= x <= -1 or y >= 7 * (x + 8) ** 2 + 1:
    print('YES')
# Правая верхняя часть крыльев
elif -1 / 8 * (x - 9) ** 2 + 8 >= y >= 1 / 49 * (x - 1) ** 2 and 1 <= x <= 8 or y >= 7 * (x - 8) ** 2 + 1:
    print("YES")
# Левая нижняя часть крыльев
elif (-8 <= x <= -2 and (x + 5) ** 2 / 3 - 7 <= y <= -4 / 63 * x ** 2 + 4 / 63) or \
        (-2 <= x <= -1 and -2 * (x + 1) ** 2 - 2 <= y <= -4 / 63 * x ** 2 + 4 / 63) or \
        (-1 <= x <= -sqrt(61 / 31) / 2 and -4 * x ** 2 + 2 <= y <= -4 / 63 * x ** 2 + 4 / 63):
    print("YES")
# Правая нижняя часть крыльев
elif (sqrt(61 / 31) / 2 <= x <= 1 and -4 * x ** 2 + 2 <= y <= -4 / 63 * x ** 2 + 4 / 63) or \
        (1 <= x <= 2 and -2 * (x - 1) ** 2 - 2 <= y <= -4 / 63 * x ** 2 + 4 / 63) or \
        (2 <= x <= 8 and (x - 5) ** 2 / 3 - 7 <= y <= -4 / 63 * x ** 2 + 4 / 63):
    print("YES")
# Тело
elif -4 * x ** 2 + 2 >= y >= 4 * x ** 2 - 6:
    print("YES")
# Усики
elif y == -1.5 * x + 2 or y == 1.5 * x + 2:
    print("YES")
# Если никакой части точка не принадлежит, то выводим NO
else:
    print("NO")
